{
  "bellman": {
    "title": "Bellman",
    "value": "Bellman is a rust crate for building zk-SNARK circuits. It provides circuit traits and primitive structures, as well as basic gadget implementations such as booleans and number abstractions."
  },
  "nvme": {
    "title": "NVMe",
    "value": "(non-volatile memory express) is a host controller interface and storage protocol created to accelerate the transfer of data between enterprise and client systems and solid-state drives (SSDs) over a computer's high-speed Peripheral Component Interconnect Express (PCIe) bus."
  },
  "multiaddr": {
    "title": "Multiaddr",
    "value": "Multiaddr is a format for encoding addresses from various well-established network protocols. It is useful to write applications that future-proof their use of addresses, and allow multiple transport protocols and addresses to coexist."
  },
  "attofil": {
    "title": "attoFIL",
    "value": "AttoFIL is a word used to describe 10^-18 FIL. The word atto comes from the Norwegian and Danish term: atten eighteen."
  },
  "fil": {
    "title": "FIL",
    "value": "A ticker symbol is an abbreviation used to uniquely identify Filecoin when it is used in a wallet exchange or a cryptocurrency exchange."
  },
  "epost": {
    "title": "Election Proof-of-Spacetime",
    "value": "Election Proof-of-Spacetime couples the Proof-of-Spacetime process with block production, meaning that in order to produce a block, the miner must produce a valid Proof-of-Spacetime proof (snark output)."
  },
  "jwt": {
    "title": "JWT",
    "value": "JSON Web Tokens are an open, industry standard RFC 7519 method for representing claims securely between two parties."
  },
  "json-rpc": {
    "title": "JSON-RPC",
    "value": "JSON-RPC is a remote procedure call protocol encoded in JSON. It is a very simple protocol (and very similar to XML-RPC), defining only a few data types and commands."
  },
  "bls-address": {
    "title": "BLS Signature (Address)",
    "value": "A Boneh–Lynn–Shacham (BLS) signature is a digital signature scheme that allows a user to determine the authenticity of a signer, and is a commonly used signature scheme in the Filecoin Distributed Storage Network."
  },
  "faucet": {
    "title": "Filecoin Test Faucet",
    "value": "A webpage where you can get free test Filecoin to participate in the Testnet."
  },
  "chain": {
    "title": "Chain",
    "value": "The Filecoin Blockchain is a distributed virtual machine that achieves consensus, processes messages, accounts for storage, and maintains security in the Filecoin Protocol. It is the main interface linking various actors in the Filecoin system."
  },
  "miner-power": {
    "title": "Miner Power",
    "value": "Miner storage in relation to network storage, tracked in the power table."
  },
  "sector": {
    "title": "Sector",
    "value": "A fixed-size block of data of SECTOR_SIZE bytes which generally contains client's data."
  },
  "sealing": {
    "title": "Sealing",
    "value": "A slow encoding process that returns commitments and proofs for data being stored in a sector."
  },
  "seal": {
    "title": "Seal",
    "value": "A slow encoding process that returns commitments and proofs for data being stored in a sector."
  },
  "posts": {
    "title": "Proof-of-Spacetime(s)",
    "value": "Filecoin is a protocol token whose blockchain runs on a novel proof, called Proof-of-Spacetime, where blocks are created by miners that are storing data."
  },
  "filecoin-testnet": {
    "title": "Filecoin Testnet",
    "value": "Until we launch, we are making lots of changes to Lotus. The Testnet is expected to bring a few significant fixes/improvements. During Testnet, you can retrieve test filecoin from our network faucet to use as collateral to start mining. Test filecoin do not have any value – the official filecoin tokens will not be released until Mainnet launch."
  },
  "filecoin-decentralized-storage-market": {
    "title": "Filecoin Decentralized Storage Market",
    "value": "Storage Market subsystem is the data entry point into the network. Storage miners only earn power from data stored in a storage deal and all deals live on the Filecoin network."
  },
  "filecoin-proof-parameters": {
    "title": "Filecoin Proof Parameters",
    "value": "The proving algorithms rely on a large binary parameter file."
  },
  "lotus-devnet": {
    "title": "DevNet",
    "value": "On the DevNets, you can store data as a storage client and also try how Filecoin mining works. The devnets are an important development tool for those who anticipate building applications on top of the Filecoin protocol or storing data on the decentralized storage market. "
  },
  "filecoin-distributed-storage-network": {
    "title": "Filecoin Distributed Storage Network",
    "value": "Filecoin is a distributed storage network based on a blockchain mechanism. Filecoin miners can elect to provide storage capacity for the network, and thereby earn units of the Filecoin cryptocurrency (FIL) by periodically producing cryptographic proofs that certify that they are providing the capacity specified."
  },
  "lotus-node": {
    "title": "Lotus Node",
    "value": "The Lotus Node is full of capabilities. It runs the Blockchain system, makes retrieval deals, does data transfer, supports block producer logic, and syncs and validates the chain."
  },
  "block-rewards": {
    "title": "Block Reward",
    "value": "Over the entire lifetime of the protocol, 1,400,000,000 FIL (TotalIssuance) will be given out to miners. The rate at which the funds are given out is set to halve every six years, smoothly (not a fixed jump like in Bitcoin)."
  },
  "block-producer-miner": {
    "title": "Miner (Block Producer)",
    "value": "The Block Producer Miner's logic. It currently shares an interface and process with the Lotus Node. A Block Producer chooses which messages to include in a block and is rewarded according to each message’s gas price and consumption, forming a market."
  },
  "lotus-storage-miner": {
    "title": "Storage Miner (lotus-storage-miner)",
    "value": "The Storage Miner's logic. It has its own dedicated process. Contributes to the network through Sector commitments and Proofs of Spacetime to prove that it is storing the sectors it has commited to."
  },
  "swarm-port": {
    "title": "Swarm Port (Libp2p)",
    "value": "The LibP2P Swarm manages groups of connections to peers, handles incoming and outgoing streams, and is part of the storage miners implementation. The port value is part of the Host interface."
  },
  "daemon": {
    "title": "Lotus Daemon",
    "value": "A Daemon is a program that runs as a background process. A Daemon in the context of the Filecoin Distributed Storage Network may enable applications to communicate with peers, handle protocols, participate in pubsub, and interact with a distributed hash table (DHT)."
  },
  "storage-deal": {
    "title": "Storage deal",
    "value": "One of the two types of deals in Filecoin markets. Storage deals are recorded on the blockchain and enforced by the protocol."
  },
  "retrieval-deal": {
    "title": "Retrieval deal",
    "value": "One of the two types of deals in Filecoin markets. Retrieval deals are off chain and enabled by micropayment channel by transacting parties."
  },
  "deal-cid": {
    "title": "Deal CID",
    "value": "CID is a format for referencing content in distributed information systems, it is a way to store information so it can be retrieved based on its content, not its location. DealCID specifically is used in storage deals."
  },
  "data-cid": {
    "title": "Data CID",
    "value": "CID is a format for referencing content in distributed information systems, it is a way to store information so it can be retrieved based on its content, not its location. DataCID specifically is used to represent the file that is stored in the Filecoin Distributed Storage Network."
  },
  "cid": {
    "title": "CID",
    "value": "A CID is a self-describing content-addressed identifier. It uses cryptographic hashes to achieve content addressing. It uses several multiformats to achieve flexible self-description, namely multihash for hashes, multicodec for data content types, and multibase to encode the CID itself into strings."
  },
  "total-network-power": {
    "title": "Total Network Power",
    "value": "A reference to all the Power Tables for every subchain, accounting for each Lotus Storage Miner on chain."
  },
  "chain-block-height": {
    "title": "Chain Block Height",
    "value": "Chain block height is defined as the number of blocks in the chain between any given block and the very first block in the blockchain."
  },
  "block-height": {
    "title": "Block Height",
    "value": "Height of the Merkle Tree of a sector. A sector is a contiguous array of bytes that a miner puts together, seals, and performs Proofs of Spacetime on."
  },
  "blocktime": {
    "title": "Blocktime",
    "value": "The time it takes for a Block to propagate to the whole network."
  }
}
